[Survived] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:40:58
 
     public class Program
     {
-        public static readonly string[] tagTypeLabels = ["primitive", "constructed"];
+        public static readonly string[] tagTypeLabels = ["", "constructed"];
         public static readonly string[] tagClassLabels = ["Universal", "Application", "ContextSpecific", "Private"];
 

[Survived] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:40:71
 
     public class Program
     {
-        public static readonly string[] tagTypeLabels = ["primitive", "constructed"];
+        public static readonly string[] tagTypeLabels = ["primitive", ""];
         public static readonly string[] tagClassLabels = ["Universal", "Application", "ContextSpecific", "Private"];
 

[NoCoverage] Logical mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:50:17
 
         public string GetTagInformation(TagClass tagClass, TagType tagType, byte tagNumber, int dataLen, ReadOnlySpan<byte> dataBuffer, ref int dataPosition)
         {
-            if (tagType == TagType.Constructed && tagNumber == (byte) ConstructedTagType.Sequence)
+            if (tagType == TagType.Constructed || tagNumber == (byte) ConstructedTagType.Sequence)
             {
                 return $"Sequence of length {dataLen}";

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:50:51
 
         public string GetTagInformation(TagClass tagClass, TagType tagType, byte tagNumber, int dataLen, ReadOnlySpan<byte> dataBuffer, ref int dataPosition)
         {
-            if (tagType == TagType.Constructed && tagNumber == (byte) ConstructedTagType.Sequence)
+            if (tagType == TagType.Constructed && tagNumber != (byte) ConstructedTagType.Sequence)
             {
                 return $"Sequence of length {dataLen}";

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:52:24
         {
             if (tagType == TagType.Constructed && tagNumber == (byte) ConstructedTagType.Sequence)
             {
-                return $"Sequence of length {dataLen}";
+                return $"";
             }
             else if (tagType == TagType.Primitive)

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:54:22
             {
                 return $"Sequence of length {dataLen}";
             }
-            else if (tagType == TagType.Primitive)
+            else if (tagType != TagType.Primitive)
             {
                 if ((tagNumber == (byte)PrimitiveTagType.Boolean) && (dataLen == 1))

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:56:22
             }
             else if (tagType == TagType.Primitive)
             {
-                if ((tagNumber == (byte)PrimitiveTagType.Boolean) && (dataLen == 1))
+                if ((tagNumber != (byte)PrimitiveTagType.Boolean) && (dataLen == 1))
                 {
                     return $"Boolean {(ReadByte(dataBuffer, ref dataPosition) == 0x00 ? "false" : "true")}";

[NoCoverage] Negate expression
repos/ProiectTSS/ProiectTSSApplication/Program.cs:56:21
             }
             else if (tagType == TagType.Primitive)
             {
-                if ((tagNumber == (byte)PrimitiveTagType.Boolean) && (dataLen == 1))
+                if (!((tagNumber == (byte)PrimitiveTagType.Boolean) && (dataLen == 1)))
                 {
                     return $"Boolean {(ReadByte(dataBuffer, ref dataPosition) == 0x00 ? "false" : "true")}";

[NoCoverage] Conditional (true) mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:58:40
             {
                 if ((tagNumber == (byte)PrimitiveTagType.Boolean) && (dataLen == 1))
                 {
-                    return $"Boolean {(ReadByte(dataBuffer, ref dataPosition) == 0x00 ? "false" : "true")}";
+                    return $"Boolean {((true?"false" :"true"))}";
                 }
                 else if ((tagNumber == (byte)PrimitiveTagType.Integer))

[NoCoverage] Conditional (false) mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:58:40
             {
                 if ((tagNumber == (byte)PrimitiveTagType.Boolean) && (dataLen == 1))
                 {
-                    return $"Boolean {(ReadByte(dataBuffer, ref dataPosition) == 0x00 ? "false" : "true")}";
+                    return $"Boolean {((false?"false" :"true"))}";
                 }
                 else if ((tagNumber == (byte)PrimitiveTagType.Integer))

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:60:27
                 {
                     return $"Boolean {(ReadByte(dataBuffer, ref dataPosition) == 0x00 ? "false" : "true")}";
                 }
-                else if ((tagNumber == (byte)PrimitiveTagType.Integer))
+                else if ((tagNumber != (byte)PrimitiveTagType.Integer))
                 {
                     // Copy signed big-endian data from DER encoding

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:64:21
                 {
                     // Copy signed big-endian data from DER encoding
                     byte[] valueBytes = new byte[dataLen];
-                    Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen);
+                    ;
 
                     // .NET expects little-endian

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:67:21
                     Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen);
 
                     // .NET expects little-endian
-                    Array.Reverse(valueBytes);
+                    ;
                     BigInteger intVal = new(valueBytes);
 

[NoCoverage] Negate expression
repos/ProiectTSS/ProiectTSSApplication/Program.cs:72:25
 
                     return $"Integer {intVal}";
                 }
-                else if((tagNumber == (byte)PrimitiveTagType.BitString) && (dataLen > 1))
+                else if(!((tagNumber == (byte)PrimitiveTagType.BitString) && (dataLen > 1)))
                 {
                     // Get unused number of bits

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:72:77
 
                     return $"Integer {intVal}";
                 }
-                else if((tagNumber == (byte)PrimitiveTagType.BitString) && (dataLen > 1))
+                else if((tagNumber == (byte)PrimitiveTagType.BitString) && (dataLen >= 1))
                 {
                     // Get unused number of bits

[NoCoverage] Negate expression
repos/ProiectTSS/ProiectTSSApplication/Program.cs:76:25
                 {
                     // Get unused number of bits
                     byte unusedBits = ReadByte(dataBuffer, ref dataPosition);
-                    if (unusedBits > 7)
+                    if (!(unusedBits > 7))
                     {
                         throw new Exception("Invalid unused bits");

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:76:25
                 {
                     // Get unused number of bits
                     byte unusedBits = ReadByte(dataBuffer, ref dataPosition);
-                    if (unusedBits > 7)
+                    if (unusedBits >= 7)
                     {
                         throw new Exception("Invalid unused bits");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:78:25
                     byte unusedBits = ReadByte(dataBuffer, ref dataPosition);
                     if (unusedBits > 7)
                     {
-                        throw new Exception("Invalid unused bits");
+                        ;
                     }
 

[NoCoverage] Arithmetic mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:82:50
                     }
 
                     // Get value bytes string
-                    byte[] valueBytes = new byte[dataLen - 1];
+                    byte[] valueBytes = new byte[dataLen + 1];
                     Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen - 1);
                     string bytesStr = BitConverter.ToString(valueBytes).Replace("-", " ");

[NoCoverage] Arithmetic mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:83:89
 
                     // Get value bytes string
                     byte[] valueBytes = new byte[dataLen - 1];
-                    Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen - 1);
+                    Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen + 1);
                     string bytesStr = BitConverter.ToString(valueBytes).Replace("-", " ");
 

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:83:21
 
                     // Get value bytes string
                     byte[] valueBytes = new byte[dataLen - 1];
-                    Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen - 1);
+                    ;
                     string bytesStr = BitConverter.ToString(valueBytes).Replace("-", " ");
 

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:84:81
                     // Get value bytes string
                     byte[] valueBytes = new byte[dataLen - 1];
                     Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen - 1);
-                    string bytesStr = BitConverter.ToString(valueBytes).Replace("-", " ");
+                    string bytesStr = BitConverter.ToString(valueBytes).Replace("", " ");
 
                     return $"Bit string with {unusedBits} unused bits and data {bytesStr}";

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:86:28
                     Buffer.BlockCopy(dataBuffer.ToArray(), dataPosition, valueBytes, 0, dataLen - 1);
                     string bytesStr = BitConverter.ToString(valueBytes).Replace("-", " ");
 
-                    return $"Bit string with {unusedBits} unused bits and data {bytesStr}";
+                    return $"";
                 }
                 else if ((tagNumber == (byte)PrimitiveTagType.OctetString))

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:88:27
 
                     return $"Bit string with {unusedBits} unused bits and data {bytesStr}";
                 }
-                else if ((tagNumber == (byte)PrimitiveTagType.OctetString))
+                else if ((tagNumber != (byte)PrimitiveTagType.OctetString))
                 {
                     // Get value bytes string

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:97:27
 
                     return $"Octed string {bytesStr}";
                 }
-                else if ((tagNumber == (byte)PrimitiveTagType.Null) && (dataLen == 0))
+                else if ((tagNumber != (byte)PrimitiveTagType.Null) && (dataLen == 0))
                 {
                     return $"Null";

[NoCoverage] Negate expression
repos/ProiectTSS/ProiectTSSApplication/Program.cs:97:26
 
                     return $"Octed string {bytesStr}";
                 }
-                else if ((tagNumber == (byte)PrimitiveTagType.Null) && (dataLen == 0))
+                else if (!((tagNumber == (byte)PrimitiveTagType.Null) && (dataLen == 0)))
                 {
                     return $"Null";

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:101:27
                 {
                     return $"Null";
                 }
-                else if ((tagNumber == (byte)PrimitiveTagType.ObjectIdentifier))
+                else if ((tagNumber != (byte)PrimitiveTagType.ObjectIdentifier))
                 {
                     // Decode first byte

[NoCoverage] Arithmetic mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:105:34
                 {
                     // Decode first byte
                     byte firstByte = ReadByte(dataBuffer, ref dataPosition);
-                    int value1 = firstByte / 40;
+                    int value1 = firstByte * 40;
                     int value2 = firstByte % 40;
 

[NoCoverage] Arithmetic mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:106:34
                     // Decode first byte
                     byte firstByte = ReadByte(dataBuffer, ref dataPosition);
                     int value1 = firstByte / 40;
-                    int value2 = firstByte % 40;
+                    int value2 = firstByte * 40;
 
                     var oidParts = new List<long> { value1, value2 };

[NoCoverage] Arithmetic mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:111:39
                     var oidParts = new List<long> { value1, value2 };
 
                     // Decode base-128 integers
-                    int endPosition = dataPosition - 1 + dataLen;
+                    int endPosition = dataPosition - 1 - dataLen;
                     while (dataPosition < endPosition)
                     {

[NoCoverage] Arithmetic mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:111:39
                     var oidParts = new List<long> { value1, value2 };
 
                     // Decode base-128 integers
-                    int endPosition = dataPosition - 1 + dataLen;
+                    int endPosition = dataPosition + 1 + dataLen;
                     while (dataPosition < endPosition)
                     {

[NoCoverage] Negate expression
repos/ProiectTSS/ProiectTSSApplication/Program.cs:112:28
 
                     // Decode base-128 integers
                     int endPosition = dataPosition - 1 + dataLen;
-                    while (dataPosition < endPosition)
+                    while (!(dataPosition < endPosition))
                     {
                         long value = 0;

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:112:28
 
                     // Decode base-128 integers
                     int endPosition = dataPosition - 1 + dataLen;
-                    while (dataPosition < endPosition)
+                    while (dataPosition > endPosition)
                     {
                         long value = 0;

[NoCoverage] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:119:38
                         do
                         {
                             b = ReadByte(dataBuffer, ref dataPosition);
-                            value = ((int)value << 7) | (int)(b & 0x7F);
+                            value = ((int)value >> 7) | (int)(b & 0x7F);
                         } while ((b & 0x80) != 0);
 

[NoCoverage] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:119:37
                         do
                         {
                             b = ReadByte(dataBuffer, ref dataPosition);
-                            value = ((int)value << 7) | (int)(b & 0x7F);
+                            value = ((int)value << 7) & (int)(b & 0x7F);
                         } while ((b & 0x80) != 0);
 

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:122:25
                             value = ((int)value << 7) | (int)(b & 0x7F);
                         } while ((b & 0x80) != 0);
 
-                        oidParts.Add(value);
+                        ;
                     }
 

[NoCoverage] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:125:62
                         oidParts.Add(value);
                     }
 
-                    return $"Object Identifier: {string.Join(".", oidParts.ToArray())}";
+                    return $"Object Identifier: {string.Join("", oidParts.ToArray())}";
                 }
             }

[NoCoverage] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:183:36
             byte tagByte = ReadByte(buffer, ref position);
 
             // Extract Tag Class (bits 8-7)
-            tagClass = (TagClass)((tagByte >> 6) & 0x03);
+            tagClass = (TagClass)((tagByte << 6) & 0x03);
 
             // Extract Tag Type (Primitive / Constructed bit 6)

[NoCoverage] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:183:35
             byte tagByte = ReadByte(buffer, ref position);
 
             // Extract Tag Class (bits 8-7)
-            tagClass = (TagClass)((tagByte >> 6) & 0x03);
+            tagClass = (TagClass)((tagByte >> 6) | 0x03);
 
             // Extract Tag Type (Primitive / Constructed bit 6)

[NoCoverage] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:186:33
             tagClass = (TagClass)((tagByte >> 6) & 0x03);
 
             // Extract Tag Type (Primitive / Constructed bit 6)
-            tagType = (TagType)((tagByte >> 5) & 0x01);
+            tagType = (TagType)((tagByte >> 5) | 0x01);
 
             // Extract Tag Number (bits 5-1)

[NoCoverage] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:186:34
             tagClass = (TagClass)((tagByte >> 6) & 0x03);
 
             // Extract Tag Type (Primitive / Constructed bit 6)
-            tagType = (TagType)((tagByte >> 5) & 0x01);
+            tagType = (TagType)((tagByte << 5) & 0x01);
 
             // Extract Tag Number (bits 5-1)

[NoCoverage] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:189:32
             tagType = (TagType)((tagByte >> 5) & 0x01);
 
             // Extract Tag Number (bits 5-1)
-            tagNumber = (byte)(tagByte & 0x1F);
+            tagNumber = (byte)(tagByte | 0x1F);
 
             // High-tag-number form not supported

[NoCoverage] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:192:17
             tagNumber = (byte)(tagByte & 0x1F);
 
             // High-tag-number form not supported
-            if (tagNumber == 0x1F)
+            if (tagNumber != 0x1F)
             {
                 throw new Exception("High-tag-number form not supported");

[NoCoverage] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:194:17
             // High-tag-number form not supported
             if (tagNumber == 0x1F)
             {
-                throw new Exception("High-tag-number form not supported");
+                ;
             }
 

[Killed] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:217:18
             byte firstByte = ReadByte(buffer, ref position);
 
             // Check if single byte length 
-            if ((firstByte & 0x80) == 0)
+            if ((firstByte | 0x80) == 0)
             {
                 return firstByte;
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_ZeroLength_ReturnsZero; ProiectTSSTests.DerReaderMutationTests.GetDataLength_ZeroLength_IsAccepted; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_SingleByte_ReturnsFirstByte

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:217:17
             byte firstByte = ReadByte(buffer, ref position);
 
             // Check if single byte length 
-            if ((firstByte & 0x80) == 0)
+            if ((firstByte & 0x80) != 0)
             {
                 return firstByte;
killedBy: ProiectTSSTests.DerReaderStructuralTests.GetDataLength_ZeroNumBytes_ThrowsException; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] Block removal mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:218:13
 
             // Check if single byte length 
             if ((firstByte & 0x80) == 0)
-            {
-                return firstByte;
-            }
+            {}
 
             // Get the number of bytes that compose the length
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_ZeroLength_ReturnsZero; ProiectTSSTests.DerReaderMutationTests.GetDataLength_ZeroLength_IsAccepted; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_SingleByte_ReturnsFirstByte

[Killed] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:223:28
             }
 
             // Get the number of bytes that compose the length
-            int numBytes = firstByte & 0x7F;
+            int numBytes = firstByte | 0x7F;
             if (numBytes == 0)
             {
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_OversizedLongForm_ParsesCorrectly; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_ZeroNumBytes_ThrowsException; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:224:17
 
             // Get the number of bytes that compose the length
             int numBytes = firstByte & 0x7F;
-            if (numBytes == 0)
+            if (numBytes != 0)
             {
                 throw new Exception("Indefinite length not supported in DER.");
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_OversizedLongForm_ParsesCorrectly; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_ZeroNumBytes_ThrowsException; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:226:17
             int numBytes = firstByte & 0x7F;
             if (numBytes == 0)
             {
-                throw new Exception("Indefinite length not supported in DER.");
+                ;
             }
 
killedBy: ProiectTSSTests.DerReaderStructuralTests.GetDataLength_ZeroNumBytes_ThrowsException; ProiectTSSTests.DerReaderFunctionalBoundaryTests.GetDataLength_EC4

[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:231:43
 
             // Add each byte to the length
             int length = 0;
-            for (int i = 0; i < numBytes; i++)
+            for (int i = 0; i < numBytes; i--)
             {
                 length = (length << 8) | ReadByte(buffer, ref position);
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_OversizedLongForm_ParsesCorrectly; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:231:29
 
             // Add each byte to the length
             int length = 0;
-            for (int i = 0; i < numBytes; i++)
+            for (int i = 0; i <= numBytes; i++)
             {
                 length = (length << 8) | ReadByte(buffer, ref position);
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_OversizedLongForm_ParsesCorrectly; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:233:27
             int length = 0;
             for (int i = 0; i < numBytes; i++)
             {
-                length = (length << 8) | ReadByte(buffer, ref position);
+                length = (length >> 8) | ReadByte(buffer, ref position);
             }
             return length;
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_OversizedLongForm_ParsesCorrectly; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength; ProiectTSSTests.DerReaderFunctionalBoundaryTests.GetDataLength_EC3

[Killed] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:233:26
             int length = 0;
             for (int i = 0; i < numBytes; i++)
             {
-                length = (length << 8) | ReadByte(buffer, ref position);
+                length = (length << 8) & ReadByte(buffer, ref position);
             }
             return length;
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_OversizedLongForm_ParsesCorrectly; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] Negate expression
repos/ProiectTSS/ProiectTSSApplication/Program.cs:247:17
         /// <exception cref="Exception">Thrown if the position is beyond the end of the buffer.</exception>
         public byte ReadByte(ReadOnlySpan<byte> buffer, ref int position)
         {
-            if (position < buffer.Length)
+            if (!(position < buffer.Length))
             {
                 return buffer[position++];
killedBy: ProiectTSSTests.DerReaderStructuralTests.GetDataLength_ZeroNumBytes_ThrowsException; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:247:17
         /// <exception cref="Exception">Thrown if the position is beyond the end of the buffer.</exception>
         public byte ReadByte(ReadOnlySpan<byte> buffer, ref int position)
         {
-            if (position < buffer.Length)
+            if (position > buffer.Length)
             {
                 return buffer[position++];
killedBy: ProiectTSSTests.DerReaderStructuralTests.GetDataLength_ZeroNumBytes_ThrowsException; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength; ProiectTSSTests.DerReaderStructuralTests.GetDataLength_MultiByte_ReturnsCombinedLength

[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:249:31
         {
             if (position < buffer.Length)
             {
-                return buffer[position++];
+                return buffer[position--];
             }
 
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_InsufficientData_ThrowsException; ProiectTSSTests.DerReaderMutationTests.GetDataLength_ZeroLength_IsAccepted; ProiectTSSTests.DerReaderMutationTests.GetDataLength_OversizedLongForm_ParsesCorrectly

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:252:13
                 return buffer[position++];
             }
 
-            throw new Exception("Unexpected end of data");
+            ;
         }
     }
killedBy: ProiectTSSTests.DerReaderMutationTests.GetDataLength_InsufficientData_ThrowsException; ProiectTSSTests.DerReaderMutationTests.GetDataLength_BufferTooShort_Throws; ProiectTSSTests.DerReaderFunctionalBoundaryTests.GetDataLength_EC5

[Killed] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:252:33
                 return buffer[position++];
             }
 
-            throw new Exception("Unexpected end of data");
+            throw new Exception("");
         }
     }
killedBy: ProiectTSSTests.DerReaderFunctionalBoundaryTests.GetDataLength_EC5
