[Killed] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:38:33
             }
 
             // Validate parameter position
-            if (position < 0 || position >= buffer.Length)
+            if (position < 0 || position > buffer.Length)
             {
                 throw new Exception("Invalid position");
killedBy: ProiectTSSTests.DerLengthParserBoundaryValueAnalysis.C_2_2_1; ProiectTSSTests.DerLengthParserBoundaryValueAnalysis.C_2_4_4; ProiectTSSTests.DerLengthParserBoundaryValueAnalysis.C_2_4_2

[Killed] Negate expression
repos/ProiectTSS/ProiectTSSApplication/Program.cs:38:17
             }
 
             // Validate parameter position
-            if (position < 0 || position >= buffer.Length)
+            if (!(position < 0 || position >= buffer.Length))
             {
                 throw new Exception("Invalid position");
killedBy: ProiectTSSTests.DerAITests.LongForm_SingleByteLength_ReturnsCorrectValue; ProiectTSSTests.DerAITests.LongForm_BufferTooShort_ThrowsException; ProiectTSSTests.DerAITests.InvalidPosition_ThrowsException

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:40:17
             // Validate parameter position
             if (position < 0 || position >= buffer.Length)
             {
-                throw new Exception("Invalid position");
+                ;
             }
 
killedBy: ProiectTSSTests.DerAITests.InvalidPosition_ThrowsException; ProiectTSSTests.DerLengthParserBoundaryValueAnalysis.C_2_2_1; ProiectTSSTests.DerLengthParserBoundaryValueAnalysis.C_2_4_4

[Killed] String mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:40:37
             // Validate parameter position
             if (position < 0 || position >= buffer.Length)
             {
-                throw new Exception("Invalid position");
+                throw new Exception("");
             }
 
killedBy: ProiectTSSTests.DerAITests.InvalidPosition_ThrowsException; ProiectTSSTests.DerLengthParserBoundaryValueAnalysis.C_2_2_1; ProiectTSSTests.DerLengthParserBoundaryValueAnalysis.C_2_4_4

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:45:29
 
             // Add each byte to the length
             long length = 0;
-            for (int i = 0; i < numBytes; i++)
+            for (int i = 0; i <= numBytes; i++)
             {
                 if (position < buffer.Length)
killedBy: ProiectTSSTests.DerAITests.LongForm_SingleByteLength_ReturnsCorrectValue; ProiectTSSTests.DerAITests.LongForm_MaxLengthValue_ParsesCorrectly; ProiectTSSTests.DerAITests.LongForm_TwoByteLength_ReturnsCorrectValue

[Killed] Equality mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:45:29
 
             // Add each byte to the length
             long length = 0;
-            for (int i = 0; i < numBytes; i++)
+            for (int i = 0; i > numBytes; i++)
             {
                 if (position < buffer.Length)
killedBy: ProiectTSSTests.DerAITests.LongForm_SingleByteLength_ReturnsCorrectValue; ProiectTSSTests.DerAITests.LongForm_BufferTooShort_ThrowsException; ProiectTSSTests.DerAITests.LongForm_MaxLengthValue_ParsesCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:49:53
             {
                 if (position < buffer.Length)
                 {
-                    length = (length << 8) | buffer[position++];
+                    length = (length << 8) | buffer[position--];
                 }
                 else
killedBy: ProiectTSSTests.DerAITests.LongForm_SingleByteLength_ReturnsCorrectValue; ProiectTSSTests.DerAITests.LongForm_BufferTooShort_ThrowsException; ProiectTSSTests.DerAITests.LongForm_MaxLengthValue_ParsesCorrectly

[Killed] Bitwise mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:49:30
             {
                 if (position < buffer.Length)
                 {
-                    length = (length << 8) | buffer[position++];
+                    length = (length << 8) & buffer[position++];
                 }
                 else
killedBy: ProiectTSSTests.DerAITests.LongForm_SingleByteLength_ReturnsCorrectValue; ProiectTSSTests.DerAITests.LongForm_MaxLengthValue_ParsesCorrectly; ProiectTSSTests.DerAITests.LongForm_TwoByteLength_ReturnsCorrectValue

[Killed] Statement mutation
repos/ProiectTSS/ProiectTSSApplication/Program.cs:53:21
                 }
                 else
                 {
-                    throw new Exception("Unexpected end of data");
+                    ;
                 }
             }
killedBy: ProiectTSSTests.DerAITests.LongForm_BufferTooShort_ThrowsException; ProiectTSSTests.DerReaderMutationTests.GetDataLength_InsufficientData_ThrowsException; ProiectTSSTests.DerReaderMutationTests.GetDataLength_BufferTooShort_Throws
